# ---------------------------------------
"""                                   """


"""
# 2 мерные Списки и Словари
"""



"""
# simple_array = [[2,5,8],[3,7,4],[1,5,2]]  -  двумерный список с использованием стандартных индексов строк и столбцов
  print(simple_array[1])  -  выводит данные из строки 1 - [3,7,4]
  print(simple_array [1] [2])  -  данные из строки 1 и столбца 2 - [4]
  simple_array [2] [1] = 5  -  присваиваем элементу 2 строки 1 стлобца значение [5]
  simple_array[1].append(3)  -  добавляем значение 3 в конец первой строки - [3,7,4,1]
  
# data_set = {"A":{"x":54,"y":82,"z":91},"B":{"x":75,"y":29,"z":80}}  -  двумерный список с использованием пользовательских меток для строк и стоблцов (A,B - строки; x,y,z - столбцы)
  print(data_set ["A"])  -  выводит информацию из строки A
  print(data_set ["B"] ["y"])  -  выовдит значение элемента строки "B", столбца "y"
  
  for i in data_set:
    print(data_set [i] ["y"])  -  выводит эементы из стоблца "y" каждой строки

  data_set ["B"] ["y"] = 53  -  присваиваем элементу строки "B", столбца "y" значение 53
  del list [getRid]  -  удаляет выбранный элемент
  
  Grades [name] = {"Maths":mscore, "English":escore}  -  добавляем строку в двумерный словарь. [name] - индекс строки, Maths и English - индексы стоблцов
  
  for name in grades:
    print((name), grades[name] ["English"])  -  выводит только значение name и оценку по English для каждого

"""


# ---------------------------------------
"""
# 96 Простой двумерный список

simple_array = [[2,5,8], [3,7,4], [1,6,9], [4,2,0]]
print(simple_array)
"""
# ---------------------------------------


# ---------------------------------------
"""
# 97 Простой двумерный список - выборочный вывод

simple_array = [[2,5,8], [3,7,4], [1,6,9], [4,2,0]]
choicestr = int(input("Выберите строку от 0 до 3: "))
choicecol = int(input("Выберите столбец от 0 до 2: "))

print("Вывод:",simple_array[choicestr] [choicecol])
"""
# ---------------------------------------


# ---------------------------------------
"""
# 98 Простой двумерный список - добавление элементов в строку

simple_array = [[2,5,8], [3,7,4], [1,6,9], [4,2,0]]
choicestr = int(input("Выберите строку от 0 до 3: "))

print("Выбранная строка:",simple_array[choicestr])

choiceadd = int(input("Введите значение которое хотите добавить в строку: "))
simple_array[choicestr].append(choiceadd)

print("Конечный результат:",simple_array[choicestr])
"""
# ---------------------------------------


# ---------------------------------------
"""
# 99 Простой двумерный список - добавление элементов в столбец

simple_array = [[2,5,8], [3,7,4], [1,6,9], [4,2,0]]
choicestr = int(input("Выберите строку от 0 до 3: "))
choicecol = int(input("Выберите столбец от 0 до 2: "))

print("Выбранная строка:",simple_array[choicestr])
print("Выбранный элемент:",simple_array[choicestr] [choicecol])

choicechange = input("Хотите изменить выбранный элемент ? Да/Нет - ")
if choicechange == "Да":
    choiceadd = int(input("Введите новое значение: "))
    simple_array[choicestr][choicecol] = choiceadd

print("Конечный результат:",simple_array[choicestr])
"""
# ---------------------------------------


# ---------------------------------------
"""
# 100 Двумерный словарь - Продавцы - Регионы

simple_set = {"Джон":{"Север":3056,"Юг":8463,"Восток":8441,"Запад":2694},
               "Том":{"Север":4832,"Юг":6786,"Восток":4737,"Запад":3612},
              "Анна":{"Север":5239,"Юг":4802,"Восток":5820,"Запад":1859},
             "Фиона":{"Север":3904,"Юг":3645,"Восток":8821,"Запад":2451}}
# print(simple_set)
"""
# ---------------------------------------